renamed dev to basestation; added build script; added readmes/updated docs; added github actions build step
